app/Controllers/Page.php

    public function manageUser()
    {
        $userModel = new UserModel();
        $user = $userModel->findAll();
---
SELECT *
FROM `user`