app/Controllers/RegistrasiController.php

    public function register()
    {
        $username = $this->request->getVar('username');
        $enkrip = $this->request->getVar('password');
        $errors = $this->validation->getErrors();
        $md5 = md5($enkrip);

        if (!$errors) {
            $dataForm = [
                'username' => $this->request->getPost('username'),
                'role' => 'user',
                'password' => $md5,
                'is_aktif' => false
            ];
            $this->user->insert($dataForm);
---
INSERT INTO `user` (`username`, `role`, `password`, `is_aktif`) VALUES ('bejo', 'user', 'd4c01b1d3471a1b41ad485918d2298cb', 0)