app/Controllers/UserController.php

    public function edit($id)
    {
        $data = $this->request->getPost();
        $validate = $this->validation->run($data, 'user');
        $cekStatus = $this->request->getPost('is_aktif');
        $errors = $this->validation->getErrors();
        $enkrip = $this->request->getPost('password');
        $md5 = md5($enkrip);

        if ($cekStatus == "0") {
            $status = isset($_GET['is_aktif']);
        } else {
            $status = isset($_POST['is_aktif']);
        }

        if (!$errors) {
            $dataForm = [
                'username' => $this->request->getPost('username'),
                'role' => $this->request->getPost('role'),
                'password' => $this->request->getPost('password'),
                'is_aktif' => $status
            ];

            $this->user->update($id, $dataForm);
---
UPDATE `user` SET `username` = 'bejo', `role` = 'user', `password` = 'd4c01b1d3471a1b41ad485918d2298cb', `is_aktif` = 1
WHERE `user`.`id` IN ('28')